In [1]:
%load_ext sql
%sql mysql+mysqlconnector://blackbasil:Naveen%402193@localhost/de_project

In [3]:
%%sql
drop table if exists regex_samples;

create table regex_samples( id int AUTO_INCREMENT PRIMARY KEY,
sample_text VARCHAR(100) 
);

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
0 rows affected.
0 rows affected.

[]

In [6]:
%%sql
INSERT INTO regex_samples (sample_text) VALUES 
('Apple'),
('Banana'),
('Cherry'),
('Date'),
('Elderberry'),
('Fig'),
('Grapes'),
('Honeydew'),
('Indian Fig'),
('Jackfruit');

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
10 rows affected.

[]

In [7]:
%%sql
select * from regex_samples
where sample_text REGEXP '^a';

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
1 rows affected.

[(1, 'Apple')]

In [8]:
%%sql
select * from regex_samples
where sample_text REGEXP 'e$';

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
2 rows affected.

[(1, 'Apple'), (4, 'Date')]

In [9]:
%%sql
select * from regex_samples
where sample_text REGEXP '^[0-9]';

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
0 rows affected.

[]

In [10]:
%%sql
select * from regex_samples
where sample_text REGEXP 'ing$';

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
0 rows affected.

[]

In [11]:
%%sql
select * from regex_samples
where sample_text REGEXP '(.)\\1';

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
3 rows affected.

[(1, 'Apple'), (3, 'Cherry'), (5, 'Elderberry')]

In [12]:
%%sql
select * from regex_samples
where sample_text REGEXP '^[A-Za-z]+$';

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
9 rows affected.

[(1, 'Apple'),
 (2, 'Banana'),
 (3, 'Cherry'),
 (4, 'Date'),
 (5, 'Elderberry'),
 (6, 'Fig'),
 (7, 'Grapes'),
 (8, 'Honeydew'),
 (10, 'Jackfruit')]

In [13]:
%%sql
select * from regex_samples
where sample_text REGEXP '^.{5}$';

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
0 rows affected.

[]

In [14]:
%%sql
select * from regex_samples
where sample_text REGEXP '[A-Z]';

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
10 rows affected.

[(1, 'Apple'),
 (2, 'Banana'),
 (3, 'Cherry'),
 (4, 'Date'),
 (5, 'Elderberry'),
 (6, 'Fig'),
 (7, 'Grapes'),
 (8, 'Honeydew'),
 (9, 'Indian Fig'),
 (10, 'Jackfruit')]

In [15]:
%%sql
select * from regex_samples
where sample_text REGEXP '^(apple|banana)$';

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
2 rows affected.

[(1, 'Apple'), (2, 'Banana')]

In [16]:
%%sql
select * from regex_samples
where sample_text REGEXP '^[0-9]{3}[A-Za-z]+$';

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
0 rows affected.

[]

In [17]:
%%sql
CREATE TABLE demo_data (
    id INT AUTO_INCREMENT PRIMARY KEY,
    fullname VARCHAR(100),
    phone VARCHAR(15),
    email VARCHAR(100),
    date_col DATE,
    status VARCHAR(20),
    sku VARCHAR(20),
    username VARCHAR(50),
    notes TEXT
);
INSERT INTO demo_data (fullname, phone, email, date_col, status, sku, username, notes) VALUES
('Alice Johnson', '9876543210', 'alice.j@example.com', '2025-06-10', 'Active', 'SKU001', 'alicej', 'First order completed.'),
('Bob Smith', '9123456780', 'bob.smith@example.com', '2025-06-11', 'Inactive', 'SKU002', 'bobsmith', 'Account suspended.'),
('Charlie Brown', '9988776655', 'charlie.b@example.com', '2025-06-12', 'Active', 'SKU003', 'charlieb', 'Preferred customer.'),
('Diana Prince', '9001122334', 'diana.p@example.com', '2025-06-13', 'Pending', 'SKU004', 'dianap', 'Verification pending.'),
('Ethan Hunt', '9090909090', 'ethan.h@example.com', '2025-06-14', 'Active', 'SKU005', 'ethanh', 'Frequent buyer.'),
('Fiona Gallagher', '9112233445', 'fiona.g@example.com', '2025-06-15', 'Inactive', 'SKU006', 'fionag', 'Requested account closure.'),
('George Lucas', '9123456701', 'george.l@example.com', '2025-06-16', 'Active', 'SKU007', 'georgel', 'Referred by Bob.'),
('Hannah Baker', '9876501234', 'hannah.b@example.com', '2025-06-17', 'Active', 'SKU008', 'hannahb', 'New registration.'),
('Ian Malcolm', '9345678123', 'ian.m@example.com', '2025-06-18', 'Pending', 'SKU009', 'ianm', 'Waiting for email confirmation.'),
('Judy Hopps', '9012345678', 'judy.h@example.com', '2025-06-19', 'Active', 'SKU010', 'judyh', 'No issues reported.');

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
0 rows affected.
10 rows affected.

[]

In [18]:
%%sql
select * from demo_data
where date_col regexp '^[0-9][0-9][0-9][0-9]-[0-9][0-9]-[0-9][0-9]$';

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
10 rows affected.

[(1, 'Alice Johnson', '9876543210', 'alice.j@example.com', datetime.date(2025, 6, 10), 'Active', 'SKU001', 'alicej', 'First order completed.'),
 (2, 'Bob Smith', '9123456780', 'bob.smith@example.com', datetime.date(2025, 6, 11), 'Inactive', 'SKU002', 'bobsmith', 'Account suspended.'),
 (3, 'Charlie Brown', '9988776655', 'charlie.b@example.com', datetime.date(2025, 6, 12), 'Active', 'SKU003', 'charlieb', 'Preferred customer.'),
 (4, 'Diana Prince', '9001122334', 'diana.p@example.com', datetime.date(2025, 6, 13), 'Pending', 'SKU004', 'dianap', 'Verification pending.'),
 (5, 'Ethan Hunt', '9090909090', 'ethan.h@example.com', datetime.date(2025, 6, 14), 'Active', 'SKU005', 'ethanh', 'Frequent buyer.'),
 (6, 'Fiona Gallagher', '9112233445', 'fiona.g@example.com', datetime.date(2025, 6, 15), 'Inactive', 'SKU006', 'fionag', 'Requested account closure.'),
 (7, 'George Lucas', '9123456701', 'george.l@example.com', datetime.date(2025, 6, 16), 'Active', 'SKU007', 'georgel', 'Referred by Bob.'),
 (8, 'Hannah Baker', '9876501234', 'hannah.b@example.com', datetime.date(2025, 6, 17), 'Active', 'SKU008', 'hannahb', 'New registration.'),
 (9, 'Ian Malcolm', '9345678123', 'ian.m@example.com', datetime.date(2025, 6, 18), 'Pending', 'SKU009', 'ianm', 'Waiting for email confirmation.'),
 (10, 'Judy Hopps', '9012345678', 'judy.h@example.com', datetime.date(2025, 6, 19), 'Active', 'SKU010', 'judyh', 'No issues reported.')]

In [21]:
%%sql
select * from demo_data
where date_col regexp '^[A-Za-z ]+$';

 * mysql+mysqlconnector://blackbasil:***@localhost/de_project
0 rows affected.

[]